system/blockMeshDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

domain
{
    xMin    -7.5;
    xMax    15;
    yMin    -7.5;
    yMax    7.5;
}

airfoil
{
    xLead   0;
    xTrail  1.01;
    yLead   0;
    yTrail  0;

    xUpper  0.08;
    xLower  0.08;
    yUpper  0.05;
    yLower -0.018;
}

geometry
{

    airfoil
    {
        type   triSurface;
        file   "airfoil.obj";
    }

    cylinder
    {
        type   cylinder;
        point1 ($!airfoil/xUpper 0 -5);
        point2 ($!airfoil/xUpper 0 5);
        radius $!domain/yMax;
    }

}

vertices
(
    project ($airfoil/xLower $domain/yMin 0) (cylinder)         // 0
    ($airfoil/xTrail $domain/yMin 0)                            // 1
    ($domain/xMax $domain/yMin 0)                               // 2

    project ($domain/xMin $airfoil/yLead 0) (cylinder)          // 3
    project ($airfoil/xLead $airfoil/yLead 0) (airfoil)         // 4
    project ($airfoil/xTrail $airfoil/yTrail 0) (airfoil)       // 5
    ($domain/xMax $airfoil/yTrail 0)                            // 6

    project ($airfoil/xLower $airfoil/yLower 0) (airfoil)       // 7
    project ($airfoil/xUpper $airfoil/yUpper 0) (airfoil)       // 8

    project ($airfoil/xUpper $domain/yMax 0) (airfoil)          // 9
    project ($airfoil/xTrail $domain/yMax 0) (airfoil)          // 10
    ($domain/xMax $domain/yMax 0)                               // 11

    project ($airfoil/xLower $domain/yMin 1) (cylinder)         // 12
    ($airfoil/xTrail $domain/yMin 1)                            // 13
    ($domain/xMax $domain/yMin 1)                               // 14

    project ($domain/xMin $airfoil/yLead 1) (cylinder)          // 15
    project ($airfoil/xLead $airfoil/yLead 1) (airfoil)         // 16
    project ($airfoil/xTrail $airfoil/yTrail 1) (airfoil)       // 17
    ($domain/xMax $airfoil/yTrail 1)                            // 18

    project ($airfoil/xLower $airfoil/yLower 1) (airfoil)       // 19
    project ($airfoil/xUpper $airfoil/yUpper 1) (airfoil)       // 20

    project ($airfoil/xUpper $domain/yMax 1) (airfoil)          // 21
    project ($airfoil/xTrail $domain/yMax 1) (airfoil)          // 22
    ($domain/xMax $domain/yMax 1)                               // 23
);

blocks
(
    hex (3 4 8 9 15 16 20 21)
    (250 100 1)
    simpleGrading (2e-5 1 1)
    
    hex (0 7 4 3 12 19 16 15)
    (250 100 1)
    simpleGrading (2e-5 1 1)

    hex (8 5 10 9 20 17 22 21)
    (150 250 1)
    simpleGrading (1 5e+4 1)

    hex (0 1 5 7 12 13 17 19)
    (150 250 1)
    simpleGrading (1 2e-5 1)

    hex (5 6 11 10 17 18 23 22)
    (150 250 1)
    simpleGrading (300 5e+4 1)

    hex (1 2 6 5 13 14 18 17)
    (150 250 1)
    simpleGrading (300 2e-5 1)
);

edges
(
    project 4 7 (airfoil)
    project 7 5 (airfoil)
    project 4 8 (airfoil)
    project 8 5 (airfoil)

    project 16 19 (airfoil)
    project 19 17 (airfoil)
    project 16 20 (airfoil)
    project 20 17 (airfoil)

    project 3 0 (cylinder)
    project 3 9 (cylinder)
    project 15 12 (cylinder)
    project 15 21 (cylinder)
);

boundary
(
    airfoil
    {
        type wall;
        faces
        (
            (4 7 19 16)
            (7 5 17 19)
            (5 8 20 17)
            (8 4 16 20)
        );
    }

    inlet
    {
        type patch;
        inGroups (freestream);
        faces
        (
            (3 0 12 15)
            (0 1 13 12)
            (1 2 14 13)
            (11 10 22 23)
            (10 9 21 22)
            (9 3 15 21)
        );
    }

    outlet
    {
        type patch;
        inGroups (freestream);
        faces
        (
            (2 6 18 14)
            (6 11 23 18)
        );
    }

    back
    {
        type empty;
        faces
        (
            (3 4 7 0)
            (7 5 1 0)
            (5 6 2 1)
            (3 9 8 4)
            (9 10 5 8)
            (10 11 6 5)
        );
    }

    front
    {
        type empty;
        faces
        (
            (15 16 19 12)
            (19 17 13 12)
            (17 18 14 13)
            (15 16 20 21)
            (20 17 22 21)
            (17 18 23 22)
        );
    }
);