0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Tinlet          298;

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Tinlet;

boundaryField
{
    inlet
    {
        type            inletOutlet;
        inletValue      uniform $Tinlet;
        value           $inletValue;
    }

    airfoil
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }

    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
